---
kind: other
id: AllMembers.T:Autodesk.Revit.Creation.ItemFactoryBase
source: html/2c54b765-d7a0-b638-419a-241f176940a8.htm
---
# ItemFactoryBase Members

Causes the object to release immediately any resources it may be utilizing.